# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# Package managers
brew "mas"
brew "whalebrew"

# Terminals & Shells
cask "iterm2"
cask "kitty"

brew "bash"
brew "bash-completion"
brew "zsh"
brew "zsh-completions"

# Common tools
brew "tmux"
brew "coreutils"
brew "binutils"
brew "findutils"
brew "diffutils"
brew "moreutils"
brew "tree"
brew "rsync"
brew "bat"
brew "exa"
brew "fd"
brew "the_silver_searcher"
brew "ripgrep"
brew "diff-so-fancy"
brew "peco"
brew "fzf"
brew "fswatch"

# System
brew "pstree"
brew "ncdu"

# Networking
brew "arping"
brew "arp-scan"
brew "dhcpdump"
brew "dhcping"
brew "socat"
brew "curl"
brew "wget"
brew "httpie"

# Security
brew "gnupg"
brew "libressl"

# Media
brew "ffmpeg"
brew "imagemagick"

# Development
brew "git"
brew "git-extras"
brew "git-lfs"
brew "tig"
brew "gibo"
brew "gh"
brew "gist"
brew "shellcheck"
brew "kubernetes-cli"
brew "helm"
brew "minikube"
brew "kind"
brew "consul"
brew "nomad"
brew "vault"
brew "tfenv"

cask "docker"

# Languages
brew "go"
brew "rustup-init"
brew "pyenv"
brew "pipx"
brew "rbenv"
brew "nvm"
brew "yarn"
brew "jq"
brew "pup"

# Clouds
brew "awscli"
cask "google-cloud-sdk"
brew "scw"

# Utilities
brew "apparix"
brew "fasd"
brew "chezmoi"
brew "gopass"
brew "direnv"
brew "desk"
brew "starship"
brew "asciinema"

# Editors & IDEs
brew "vim"
brew "neovim"

cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "atom"

# Applications
cask "google-chrome"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
cask "keybase"
cask "notion"
cask "vlc"

# Fonts
# noto
# fira
# dejavu
# hack
# source code pro
# inconsolata
# nerdfonts

# macOS specific tools
cask "alfred"
mas "Divvy", id: 413857545
cask "scroll-reverser"
cask "cheatsheet"

brew "trash"
brew "duti"
